[
    {
        "company": "Google",
        "title": "Software Engineer III, Infrastructure, YouTube",
        "location": "San Bruno, CA",
        "description": "Minimum qualifications:\n\nBachelor’s degree or equivalent practical experience.\n2 years of experience with software development in one or more programming languages, or 1 year of experience with an advanced degree in an industry setting.\n2 years of experience with data structures or algorithms in either an academic or industry setting.\n2 years of experience with developing large-scale infrastructure, distributed systems or networks, and/or experience with compute technologies, storage or hardware architecture.\nProgramming experience in C++.\n\nPreferred qualifications:\n\nMaster's degree or PhD in Computer Science or related technical fields.\n2 years of experience with performance, large scale systems data analysis, visualization tools, and/or debugging.\nExperience developing accessible technologies.\nProficiency in code and system health, diagnosis and resolution, and software test engineering.\n\nAbout The Job\n\nGoogle's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.\n\nWith your technical expertise you will manage project priorities, deadlines, and deliverables. You will design, develop, test, deploy, maintain, and enhance software solutions.\n\nGoogle is an engineering company at heart. We hire people with a broad set of technical skills who are ready to take on some of technology's greatest challenges and make an impact on users around the world. At Google, engineers not only revolutionize search, they routinely work on scalability and storage solutions, large-scale applications and entirely new platforms for developers around the world. From Google Ads to Chrome, Android to YouTube, social to local, Google engineers are changing the world one technological achievement after another.\n\nThe US base salary range for this full-time position is $136,000-$200,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target for new hire salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.\n\nPlease note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google .\n\nResponsibilities\n\nWrite product or system development code.\nParticipate in, or lead design reviews with peers and stakeholders to decide amongst available technologies.\nReview code developed by other developers and provide feedback to ensure best practices (e.g., style guidelines, checking code in, accuracy, testability, and efficiency).\nContribute to existing documentation or educational content and adapt content based on product/program updates and user feedback.\nTriage product or system issues and debug/track/resolve by analyzing the sources of issues and the impact on hardware, network, or service operations and quality.\n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form ."
    },
    {
        "company": "Archer",
        "title": "Aerospace Embedded Software Engineer",
        "location": "San Jose, CA",
        "description": "Archer is an aerospace company based in San Jose, California building an all-electric vertical takeoff and landing aircraft with a mission to advance the benefits of sustainable air mobility. We are designing, manufacturing, and operating an all-electric aircraft that can carry four passengers while producing minimal noise.\n\nOur sights are set high and our problems are hard, and we believe that diversity in the workplace is what makes us smarter, drives better insights, and will ultimately lift us all to success. We are dedicated to cultivating an equitable and inclusive environment that embraces our differences, and supports and celebrates all of our team members.\n\nWe are looking for an Embedded Software Engineer to join our team at Archer. The role involves designing, developing, and testing safety-critical software for Archer's powertrain systems. We're building an all-electric vertical takeoff and landing aircraft focused on improving mobility in cities and driving the world toward a zero-emissions future. If you or someone you know is interested, please apply at https://www.flyarcher.com/careers\n\nWho we are: \n\nArcher is an aerospace company based in San Jose, California, building an all-electric vertical takeoff and landing aircraft with a mission to advance the benefits of sustainable air mobility. We are designing, manufacturing, and operating an all-electric aircraft that can carry four passengers for 100 miles at speeds of up to 150 mph while producing minimal noise.\n\nOur sights are set high, and our problems are hard. We believe that workplace diversity makes us smarter, drives better insights, and will ultimately lead us all to success. We are dedicated to cultivating an equitable and inclusive environment that embraces our differences and supports and celebrates all of our team members.\n\nWhat you’ll do:\n\nDevelop safety-critical software components for the Powertrain software team, including battery management systems, motor controllers and core/platform.\nParticipate in planning, design, coding, and testing.\nWork with system engineers to decompose requirements into high-level and low-level software requirements in compliance with DO-178C.\nWork with multi-disciplinary teams to develop and integrate complex hardware/software systems.\nSoftware requirements decomposition, analysis, definition, and traceability.\nSoftware analyses, requirements-based testing, and structural coverage analysis. \nContribute to the continuous improvement of our processes to increase safety and efficiency.\n\nWhat you need:\n\nAt least a BS in Electrical Engineering, Computer Engineering, Computer Science, or a related degree\nProficiency with C\nFluency with Python\nExperience developing embedded software - preferably in a regulated environment complying with safety standards like DO-178C or ISO 26262\nFamiliarity with debuggers and lab instruments such as oscilloscopes and bus analyzers\nExcellent organizational and communication skills\n\nBonus Qualifications\n\nExperience working on software for Flight controls systems, Electric Vehicles (EV) powertrains, including motor control and battery management systems\nFamiliarity with modeling tools like UML or SysML\nKnowledge of Real-Time Operating Systems (RTOS) and multi-threading\nExperience with civil aerospace SW development\n\nArcher is proud to be an Equal Opportunity Employer committed to diversity and inclusivity in the workplace. All aspects of employment are decided based on merit, qualifications, and business needs. We do not discriminate based on race, color, religion, sex, sexual orientation, age, national origin, disability status, protected veteran status, gender identity, or any other characteristic protected by federal, state, or local laws.\n\nAt Archer we aim to attract, retain, and motivate talent that possess the skills and leadership necessary to grow our business. We drive a pay-for-performance culture and reward performance that supports the Company’s business strategy. For this position we are targeting a base pay between $134,400 - $168,000. Actual compensation offered will be determined by factors such as job-related knowledge, skills, and experience.\n\n Archer is unable to provide work visa sponsorship for this position at the present time.   Archer is proud to be an Equal Opportunity employer committed to diversity and inclusivity in the workplace. All aspects of employment are decided on the basis of merit, qualifications, and business needs. We do not discriminate based upon race, color, religion, sex, sexual orientation, age, national origin, disability status, protected veteran status, gender identity or any other characteristic protected by federal, state or local laws.   Archer Aviation does not engage with external recruiting agencies/individual recruiters with whom it does not have a prior written agreement. Archer reserves the right to make use of any unsolicited resumes that it receives and bears no responsibility for payment of any fees asserted from the use of unsolicited resumes. If you are a recruiting agency or individual recruiter wishing to do business with Archer, please reach out to People@archer.com . All employment processes are managed by the Archer People Team."
    },
    {
        "company": "NAVEX",
        "title": "Account Executive, SMB (Farmer)",
        "location": "Charlotte, NC (Hybrid)",
        "description": "It's fun to work in a company where people truly BELIEVE in what they're doing!\n\nWe're committed to bringing passion and customer focus to the business.\n\nPosition Summary:\n\nNAVEX provides a full suite of integrated risk and compliance management software products. We’re an industry leader with exciting plans to continue growing, and we’re looking for driven, enthusiastic Account Executives to be a part of this growth. If you’ve been looking for a company where you can feel like the product you sell is making a positive impact in the world, then look no further! We help companies protect their people, their reputation and their bottom line.\n\nIn this role, you’ll proactively partner with existing customers to identify opportunities for cross-sell and upsell with your prospecting prowess. You’ll identify and engage with the decision makers within an organization to uncover their needs, apply our sales methodology by demonstrating the value of our products and assist them through the implementation process. The ideal candidate will have a desire for learning, be relationship driven, energetic and passionate about selling new business in a team environment. A competitive edge with a drive for results and to make money will certainly influence your success with us as well!\n\nAs a NAVEX Account Executive, you will thrive alongside an engaged and collaborative team invested in supporting your success! In this hybrid role you will be working with colleagues in our Charlotte, North Carolina headquarters Tuesday, Wednesday, Thursday each week.  \n\n\nWe you'll get:\n\nInspiring Culture. Invested teammates, belonging groups, and a socially determined culture\nMeaningful Work. Innovative products and solutions with real life impact for people and organizations\nCareer Growth. Stellar training, mentorship, and an unwavering commitment to your growth and success\nLife Flexibility. To care for you, your loved ones and your community\nIndustry Leadership. A highly reputable, fast growing and consistently profitable organization\nReal Rewards. Competitive and transparent pay practices, wellbeing programs and benefits with choice\n\n\nWhat you'll do:\n\nProactively build and maintain relationships with existing NAVEX customers to create new business opportunities through cross-sell and upsell, presenting the value of integrating our platform risk and compliance management solutions and services\nIdentify and engage existing customers, leveraging your prospecting techniques to expand our solution and service offerings to advance our sales goals\nCreate and leverage your network of internal and external partners to improve access to resources and expertise to best engage our customers and support the sales cycle\nUtilize and coordinate internal resources to advance the sales cycle, ensuring a healthy customer relationship; will work closely with Solutions Engineering, Product Specialists, Legal, Customer Success, Marketing, Services & Support, etc.\nNavigate buying groups across different functions and use your understanding of the complexity of a multi-party / enterprise sale to advance our sales goals\nDeliver persuasive presentations by storytelling actual business scenarios in an engaging and compelling manner to key decision makers to impress customers with your industry and product knowledge\nIdentify and meet customer needs, offering best solutions\nEffectively develop and prioritize a pipeline of opportunity beyond what is needed to achieve your sales goals, accurately forecasting sales\nCrush your sales quota, negotiating and closing opportunities\n\n\nWhat you'll need:\n\n1 + years of B2B (business-to-business) sales experience; SaaS experience a plus, but we’ll teach you what you don’t already know!\nA passion for learning; our industry and work environment are dynamic\nStrong prospecting, planning, organizational and time-management skills. This is a fast-paced role and the ability to stay on top of your day is key!\nStrong presentation skills, having a persuasive and patient, yet compelling and compassionate approach. You’ll be forging strong relationships with customers and must be able to earn their trust\nTechnical ability to be proficient with Salesforce and Microsoft Office products\nAbility to approach, recognize and anticipate process and operational problems and effectively identify areas for improvement\nExcellent verbal and written communication skills and a commitment to participate effectively with a team and collaborate with people across a variety of levels with diverse backgrounds\n\n\nOur side of the deal:\n\nWe believe each member of our team deserves to see a path forward to achieving their career and financial goals.\nEach team member is required to have a career plan in place and reviewed with their manager after six months with our team.\nThe starting pay for this role is $65,000 per annum and the target variable pay for this role is $55,000. Target variable pay is based on individual achievement factors and is not guaranteed.\nPay progression is based on performance.\n\n\nWe’re committed to helping you thrive in all aspects of your life. Our pay programs are just one element of this. Check out NAVEX’s career page to find out more information.\n\n\nWe’re an equal opportunity employer, including all disability and veteran status.\n\n\nIf you like wild growth and working with happy, enthusiastic over-achievers, you'll enjoy your career with us!"
    }
]
